
namespace SYPHU.Assay.ConstTables
{
    /// <summary>
    /// Grubbs表格，暂时不用了
    /// </summary>
    public static class GrubbsTable
    {
        /// <summary>
        /// a = 0.01
        /// </summary>
        private static readonly double[] Table =
            {
                1.155, 1.492, 1.749, 1.944, 2.097, 2.221, 2.323, 2.410, 2.485, 2.550, 2.607, 2.659, 2.705, 2.747, 2.785,
                2.821, 2.854, 2.884, 2.912, 2.939, 2.963, 2.987, 3.009, 3.029, 3.049, 3.068, 3.085, 3.103, 3.119, 3.135,
                3.150, 3.164, 3.178, 3.191, 3.204, 3.216, 3.228, 3.240, 3.251, 3.261, 3.271, 3.282, 3.292, 3.302, 3.310,
                3.319, 3.329, 3.336, 3.345, 3.353, 3.361, 3.368, 3.376, 3.383, 3.391, 3.397, 3.405, 3.411, 3.418, 3.424,
                3.430, 3.437, 3.442, 3.449, 3.454, 3.460, 3.466, 3.471, 3.476, 3.482, 3.487, 3.492, 3.496, 3.502, 3.507,
                3.511, 3.516, 3.521, 3.525, 3.529, 3.534, 3.539, 3.543, 3.547, 3.551, 3.555, 3.559, 3.563, 3.567, 3.570,
                3.575, 3.579, 3.582, 3.586, 3.589, 3.593, 3.597, 3.600
            };

        public static int GetMinRegNum
        {
            get { return 3; }
        }

        public static int GetMaxRegNum
        {
            get { return GetMinRegNum + Table.Length - 1; }
        }

        public static double GetValue(int regNum)
        {
            return Table[regNum - GetMinRegNum];
        }
    }
}
